## Task 1 - Dictionaries, Lists and data manipulation

In this part we will revisit a fundamental data structure in python - Dictionaries.

### 1.1: Create a dictionary that has 3 keys: name, age and salary, and enter in the following dummy information.

#### Sample output
> {'name': 'Tim Cook', 'age': 59, 'salary': 3000000.0}

In [5]:
#Your Solution Here

mydict={"name": "Kato", "age": 23, "salary":100000}
mydict

{'name': 'Kato', 'age': 23, 'salary': 100000}

### 1.2: Create a second dictionary, this time with at least 5 different names, ages, and salaries.

*Hint: There should only be three keys, and the values should be a list.*

#### Sample Output

> {'name': ['Tim Cook', 'Person 2', 'Person 3'],
> 'age': [59, 24, 40],
> 'salary': [30000000.0, 200000.0, 900000.0]}

In [4]:
#Your Solution Here
mydict2={"name": ["Kato","Suzy","Reba","Jamie","Mari"], "age": [23,18,17,22,21], "salary":[100000,50000,60000,70000,20000]}
mydict2

{'name': ['Kato', 'Suzy', 'Reba', 'Jamie', 'Mari'],
 'age': [23, 18, 17, 22, 21],
 'salary': [100000, 50000, 60000, 70000, 20000]}

### 1.3: Create a pandas dataframe using the dictionary you created above

**Hint: Use the `pd.DataFrame.from_dict()` method**

#### Sample output
![](images/df.png)

In [7]:
#Your Solution Here
import pandas as pd
char=pd.DataFrame.from_dict(mydict2)
char

    name  age  salary
0   Kato   23  100000
1   Suzy   18   50000
2   Reba   17   60000
3  Jamie   22   70000
4   Mari   21   20000

### 1.4: Rename all three columns of the dataframe

*Hint: you should use the pandas function [rename()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html) to accomplish this. You can rename it to whatever you like, just show us you are able to use this function*

In [8]:
# Your Solution Here
char.columns=["a","b","c"]
char

       a   b       c
0   Kato  23  100000
1   Suzy  18   50000
2   Reba  17   60000
3  Jamie  22   70000
4   Mari  21   20000